{"meta":{"title":"Tengjun's BCI Site","subtitle":null,"description":"Tengjun's BCI(Brain-Computer Interface) Site, record my learning experience in BCI.","author":"Tengjun Liu","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"Basic grammar of Markdown/Markdown的基本语法","slug":"Basic-grammar-of-Markdown","date":"2019-03-10T16:46:48.000Z","updated":"2019-03-11T11:52:14.710Z","comments":true,"path":"2019/03/11/Basic-grammar-of-Markdown/","link":"","permalink":"http://yoursite.com/2019/03/11/Basic-grammar-of-Markdown/","excerpt":"","text":"1. Header: The symbol “#” indicates the level of a header, which is shown as follows: first-level header “# first-level header”: first-level header second-level header “## second-level header”: second-level header fifth-level Header “## fifth-level header”: fifth-level header And so on. 2. Typeface: Bold: **The text to be bold** Result: The text to be bold Italic: *The test to be italic* Result: The text to be italic Bold and Italic: ***The test to be bold and italic*** Result: The test to be bold and italic Strikethough: ~~The test to be trikethough~~ Result: The test to be trikethough Newline: two ‘ ‘ in the gap between the 2 texts. Result:Tip: If you want share your labrary by copying the files, you need to copy both the .data file and the .enl file. They need to work togeter. 3. Quotation: The symbol “&gt;” indicates the level of a quotation just as what “#” does. Grammar: &gt; the quotation &gt;This is the first-level quotation And so on. 4. Split Line: Symbol: more than 3 “-“ or “*“, the results are shown as follows: 5.Figure: Grammar: ![the caption(shown below the fiure)](the address of the figure (can be online or offline)”the title of the fiure(shown when the mouse is over the figure)”) However, the offline way is not recommanded. (Offline way cannot be use in deployment of a website) 6. Hyperlink: Grammar: [Hyperlink’s name](Address “title”) Emoji’s website 7. List: Unordered: symbol ‘-’ or ‘+’ or ‘*‘, the result is just like this line. Ordered: 1. or 2. or 3. and so on, the result is just like this line. nesting: three ‘ ‘(blank) between the indexes. 8. Table:Grammar:(No blank line!) header 1|header 2|deader 3 —|:–:|—: content 11|content 21|content 31 content 12|content 22|content 32 The result is as follows: header 1 header 2 deader 3 content 11 content 21 content 31 content 12 content 22 content 32 9. Code:Grammar: ‘One line code’ create database hero; ‘’’ A passage of code’’’ 1234function fun()&#123; echo &quot;Hello world!&quot;;&#125;fun();","categories":[],"tags":[{"name":"Basic Skills/基本技能","slug":"Basic-Skills-基本技能","permalink":"http://yoursite.com/tags/Basic-Skills-基本技能/"}],"keywords":[]},{"title":"Basic usage of EndNote/EndNote的基本使用","slug":"Basic-usage-of-EndNote","date":"2019-03-10T16:45:58.000Z","updated":"2019-03-11T11:59:43.173Z","comments":true,"path":"2019/03/11/Basic-usage-of-EndNote/","link":"","permalink":"http://yoursite.com/2019/03/11/Basic-usage-of-EndNote/","excerpt":"","text":"IntroductionEndNote is a software developed by ISI Thomson. Its main features include: Collect and store the documents. (Title, arthor, year, journal, reference type, etc.) Find and manage the documents. (Search, rating, group, etc.) Help the researchers use the correct format for the papers. (Paper templates for different journals, working together with Word, etc.) We can regard what EndNote does as building a personal library, where the books, journals, videos, legal papers, pictures and others are stored. Besides EndNote Destop, EndNote Web is also availbale. Building or opening a libaryFile-&gt; New… or File-&gt; Open Library… or Open recent Tip: If you want share or move your labrary by copying the files, you need to copy both the .data file and the .enl file. They need to work togeter. Importing Documents Manual input(Not recommanded):Reference -&gt; New Reference or click the ‘New Reference’ button or use the keyboard shortcut (Ctrl+N). When you input the author, the system will regrad the last word as the family name automatically. And if the arthor’s given name contains more than one word, the first name and the last name should be seperated by ‘,’. Remember to attach the files (.pdf, .jpg, .mov, etc.), if not, it’s just a bunch of information. Use ‘the find full text’ function can make it easy to get done. Steps:Choose the document you want to find the full text, and then click the Reference-&gt; Find full text. Make sure you have right network connect, which means you can get access to the databases. Importing file…/Folder…:File-&gt;Import-&gt;File…/Folder…. When you are importing a file, remember to change the import option to DPF. Besides, you can import a library here just by change the import option to EndNote Library. When you are imorting a folder, you can choose if the result includes the subfolders and create a group set for this import. Importing online:Take Web of Science as an example. Choose the papers need downloading. Choose save to EndNote Destop (Or EndNote Online if you like). Choose the content to be saved and click send button. Open the .ciw file that is just downloaded by EndNote Destop. Find full text for the papers or attach them manually. Likely, this approach can be used in Google Scholar, 万方数据库, etc. More details about how to import documents from diffrent databases or connect other libraries can be seen in EndNote &amp; Word文献管理与论文写作 第2版_童国伦主编2014.pdf. Managing the Libraries Group: Set up groups: To classify the documents. Right-click the ‘My Groups’ in the left of the UI. Groups-&gt;Create Group Smart Group:Assemble the documents that contain the same key words. Create groups from groups.Create From Groups: Intersection, complement, etc. Create groups set.The directory above the groups level. Search the documents. Quick search. Search Panel. Click the button to use. Find the Duplicates. References-&gt;Find Duplicates The setting of this function can be changed in Edit-&gt;Preference-&gt;Duplicates Revise the ducuments’ data (Title, abstract, etc.)Edit-&gt;Find and Replace Back-up for the libraries. Copy and paste the .data and .enl files. File-&gt;Save a Copy… Compress the LibraryCompressed Library(.enlx)… Filter.Filters need to be created or found online when the embedded filters are not enough, more details is in EndNote &amp; Word文献管理与论文写作 第2版_童国伦主编2014.pdf. Change the field(字段) to be shown about a document.Edit-&gt;Preference-&gt;Display Fields Paper Writing Papers templates.Tools-&gt;Manuscript templates. Cite While You Write (CWYW).To use this function, you need to open both EndNote and Word. Drag the papers you want to cite in EndNote to Word. Click the ‘Update Citations and Bibliography’ in EndNote X9 (or other versions) in Word. $$x=\\frac{-b\\pm\\sqrt{b^2-4ac}}{2a}$$","categories":[],"tags":[{"name":"Basic Skills/基本技能","slug":"Basic-Skills-基本技能","permalink":"http://yoursite.com/tags/Basic-Skills-基本技能/"}],"keywords":[]},{"title":"Hello World","slug":"hello-world","date":"2019-03-01T03:43:36.770Z","updated":"2019-03-10T16:43:11.253Z","comments":true,"path":"2019/03/01/hello-world/","link":"","permalink":"http://yoursite.com/2019/03/01/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[{"name":"test","slug":"test","permalink":"http://yoursite.com/tags/test/"}],"keywords":[]}]}