{"meta":{"title":"Tengjun's BCI Site","subtitle":null,"description":"Tengjun's BCI(Brain-Computer Interface) Site, record my learning experience in BCI.","author":"Tengjun Liu","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"Note for the Basic Principles of ERD&ERS /事件相关去同步化/同步化的基本原则笔记","slug":"Note-for-the-Basic-Principles-of-ERD-ERS","date":"2019-08-13T12:44:40.000Z","updated":"2019-08-13T10:13:33.180Z","comments":true,"path":"2019/08/13/Note-for-the-Basic-Principles-of-ERD-ERS/","link":"","permalink":"http://yoursite.com/2019/08/13/Note-for-the-Basic-Principles-of-ERD-ERS/","excerpt":"","text":"The basic principles of ERD/ERSEvent-related potentials/fields vs. event-related EEG/ MEG changes(ERD/ERS)event-related potentials (ERP) The basic assumption is that the evoked activity, or signal of interest, has a more or less fixed time-delay to the stimulus, while the ongoing EEG/ MEG activity behaves as additive noise. Phase-locked? evoked potentials (EPS) can be considered to result from a reorganization of the phases of the ongoing EEG signals. Averaging techniques are commonly used Not enough ERPs represent the responses of cortical neurons due to changes in afferent activity event-related desynchronization (ERD) and event-related synchronization (ERS) ERD/ ERS phenomena can be viewed as generated by changes in one or more parameters that control oscillations in neuronal networks which are the general properties of such oscillations? the intrinsic membrane properties of the neurons and the dynamics ofsynaptic processes the strength and extent of the interconnections between the networkelements, most often formed by feedback loops. Different kinds offeedback loops can be distinguished: involving thalamocortical orcortico-cortical either at short or at long distances The modulating influences from general or local neuro transmittersystems Fig. 1. Schema for the generation of induced (ERD/ERS) and evoked (ERP) activity whereby the former is highly frequency-specific. TCR thalamic relay cells: RE reticular thalamic nucleus What do ‘induced’ and ‘evoked’ mean? Neuronal networks can display different states of synchrony, with oscillations at different frequencies. ERD/ERS reflect changes in the activity of local interactions between mainneurons and interneurons that control the frequency components of theongoing EEG when referring to ERD/ERS of the EEG/MEG it is necessary to specify thefrequency band. the term ERD is only meaningful if the baseline measured some secondsbefore the event represents a rhythmicity seen as a clear peak in thepower spectrum Similarly, the term ERS only has a meaning if the eventresults in the appearance of a rhythmic component and therewith in aspectral peak that was initially not detectable. Frequency-specificity of brain oscillationsIn general, the frequency of brain oscillations is negatively correlated with their amplitude Because the amplitude of oscillations is proportional to the number of synchronously active neural elements slowly oscillating cell assemblies comprise more neurons than fast oscillating cells Quantification of ERD/ERS in time and spaceTime course of ERD/ERS the EEG/MEG power within identified frequency band is displayed relative (as percentage) to the power of the same EEG/MEG derivations recorded during the reference or baseline period a few seconds before the event occurs the interval between two consecutive events should last at least some seconds In the case of voluntary limb movement studies, aninter-event-interval of at least approximately 10 s isrecommended in the case of a fore-period reaction time task, theinterval should be even longer The classical method to compute the time course of ERD bandpass filtering of all event-related trials squaring of the amplitude samples to obtain power samples averaging of power samples across all trials averaging over time samples to smooth the data and reduce thevariability obtaining percentage values for ERD/ERS the power within the frequency band of interest in theperiod after the event is given by A whereas that of thepreceding base line or reference period is given by R. ERDor ERS is defined as the percentage of power decrease orincrease respectively, according to the expression ERD%=(A-R)/R×100. The different methods used today for ERD/ERS quantification Spatial mapping of ERD/ERS To convert the reference-dependent raw data in reference-free data.different methods are available Common average reference Laplacian reference Reference-free maps (e.g. surface Laplacian ) generally showa more focal pattern as compared to referential maps and areespecially recommended when data corresponding to a movementtask are analyzed. Local average reference For spatial mapping of ERD/ERS, different methods are available surface Laplacian cortical imaging distributed source imaging Others Determination of subject-specific frequency bandsdetection of the most reactive frequency band based on the comparison of two short-term power spectra One spectrum is calculated for the reference period (R)chosen someseconds before an event occurs the other is calculated for the activity period (A) The difference curve between the 2 logarithmic power spectra ofperiods A and R, together with 95% confidence interval. can be usedto determine significant frequency components Fig. 5. (a)Superimposed logarithmic 1 s reference period (R) and the activity period (A) during cue-triggered finger movement as well as the difference between the two spectra with 95% confidence intervals indicated by the dotted lines. The frequency range displaying significant power increase is marked. (b) Band power time course calculated for the frequency band indicated in (a) triggered according to cue-onset (vertical line) and significance level (sign test P from 10\\^-2 to 10\\^-8) for power changes (step function). A power decrease indicates ERD and a power increase ERS. The horizontal line marks the band power in the reference period continuous wavelet transform(CWT) The amount of dilation of the wavelet is represented by the scale aand the shifting of the wavelet by parameter b (c) Scalogram displaying the squared and over all trials averaged wavelet coefficients for the time interval 2 to 8 s (axis). Scale (left axis) running from 24 to 64 corresponds to a frequency range (right axis) from 12 to 32 Hz. Color-scale from ’black’ (minimum) to red (maximum). definition of frequency bands relative to the spectral peak frequency The use of a mean alpha peak center of gravity (centroid) frequency f(i) as an anchor point to adjust frequency bands individually ERD in memory and movement tasksLower alpha desynchronization (in the range of about 7-10 HZ) is obtained in response to almost any type of task topographically widespread over wide areas of the scalp probably reflects general task demands and attentional processes Upper alpha( mu) desynchronization (in the range of about 10-12 Hz) very often topographically restricted develops during the processing of sensory-semantic information aboveparieto-occipital areas memory The degree of desynchronization is closely linked to semantic memoryprocesses Voluntary movement Voluntary movement results in a circumscribed desynchronization inthe upper alpha and lower beta bands, localized close tosensorimotor areas This desynchronization starts about 2 s prior to movement-onset overthe contralateral Rolandic region and becomes bilaterallysymmetrical immediately before execution of movement the topography of beta ERD was often more discrete andsomatotopically specific than that of alpha ERD The contralateral dominant pre-movement mu ERD is not onlyindependent of movement duration, but also similar with indexfinger, thumb and hand movement While a circumscribed hand area mu ERD can be found in nearly everysubject, a foot area mu ERD localized close to the primary foot areabetween both hemi- spheres is less frequent This can be interpreted as follows: the mu rhythm isgenerated mainly in the post-rolandic somatosensory area andthe central beta rhythm (at least some components of it ) inthe pre-rolandic motor area a variety of Rolandic mu rhythms exist. mu rhythms not only selectively blocked with arm and legmovements, but also with face movement Simultaneous occurrence of ERD and ERS in the alpha and lower beta bandsA visual input results not only in a desynchronization of occipital alpha rhythms but also in an enhancement or synchronization of centralmu rhythms The opposite, an enhancement of occipital alpha rhythms and desynchronization of central mu rhythms, is found, e.g. during self-paced, voluntary hand movementPost-movement beta ERSThese induced beta oscillations are found in the first second after termination of a voluntary movement, when the Rolandic mu rhythm still displays a desynchronized pattern of low amplitude Time evolution of band power changes calculated in the indicated frequency bands (right side). Brisk movement-offset is marked with a vertical line at second 7. In addition to the power changes (thick line), the significance levels of power changes (thin line) are indicated. The scale on the right indicates significance levels 10” to 10(sign test); the scale on the left gives percentage power changes features The post-movement beta ERS is a relatively robust phenomenon and isfound in nearly every subject after finger, hand, arm and foot movement the beta ERS is significantly larger with hand as compared to fingermovement For finger movement the largest beta ERS was found in the 16-21 Hzband, and for foot movement in the slightly higher 19-26 Hz band the beta ERS has a somatotopic organization It is dominant over the contralateral primary sensorimotor area andhas a m around 1000 ms after movement-offset the maximum of the beta ERS coincides with a reducedexcitability of motor cortex neurons For the activation of a larger muscle mass, a relativelylarger population of cortical is required the beta ERS may be related to a deactivated state of the motorcortex the beta ERS is found not only after a really executed but also after animagined movement Interpretation of ERD and ERS in the alpha and lower beta bandRED Increased cellular excitability in thalamocortical systems resultsin a low amplitude desynchronized EEG ERD can be interpreted as an electrophysiological correlate ofactivated cortical areas involved in processing of sensory orcognitive information or production of motor behavior An increased and/or more widespread ERD could be the result of theinvolvement of a larger neural network or more cell assemblies ininformation processing increased task complexity Once the movement sequence has been learned and the movementis performed more ‘automatically’, the ERD is reduced activity in primary sensorimotor areas Increases inassociation with learning a new motor task and decreasesafter the task has been learned The involvement of primary motor area in learning motorsequences was also suggested more efficient task performance more effort and attention as needed in patients elderly or lower IQ subjects ERS amplitude enhancement is based on the cooperative or synchronizedbehavior of a large number of neurons Large alpha or mu waves in the EEG/MEG need coherent activity ofcell assemblies over at least several square centimeters When patches of neurons display coherent activity in the alphaband, an active processing of information is very unlikely andit may be assumed that the corresponding networks are in adeactivated state It is of interest to note that about 85% of cortical neuronsare excitatory, with the other 15%o being inhibitory occipital alpha rhythms can be considered as idling rhythms of thevisual areas and mu rhythms as ‘idling rhythms’ of sensorimotorareas there are also reports on induced (synchronized )alpha band rhythmsbefore omitted stimuli there are always scalp electrodes showing synchronized anddesynchronized alpha (beta) band rhythms at the same moment of time ERS in the gamma band (40Hz)Difference Separate foci of synchronized gamma activities occurring in cortical regions which are widely separated-often even in different lobes-can display high correlation during the performance of cognitive or motor tasks an increase in gamma band coherence is functionally related to the performed task ERD/ERS in neurological disordersThe quantification of movement-related desynchronization can improve the diagnosis of functional deficits in patients with cerebrovascular disorders and Parkinson’s disease ( PD) Based on ERD measurements during voluntary hand movement it was, forexample, possible to differentiate between superficial and deepvascular lesions In case of PD. the pre movement ERD is less lateralized over thecontralateral sensorimotor area and starts later than in controlsubjects The beta ERS is of smaller magnitude and it is delayed as comparedto controls ERD changes in epilepsy with focal motor seizures were reported by Derambure et alMind Map of PDF version: The basic princiles of ERD and ERS.pdf.pdf). Reference:Pfurtscheller G, Da Silva F H L. Event-related EEG/MEG synchronization and desynchronization: basic principles[J]. Clinical neurophysiology, 1999, 110(11): 1842-1857.","categories":[],"tags":[{"name":"Basic Knowledge/基本知识","slug":"Basic-Knowledge-基本知识","permalink":"http://yoursite.com/tags/Basic-Knowledge-基本知识/"}],"keywords":[]},{"title":"Some useful techniques of Matlab (Updating)/一些Matlab有用的技巧（更新中）","slug":"Some-useful-techniques-of-Matlab","date":"2019-05-26T10:52:48.000Z","updated":"2019-08-13T09:46:17.988Z","comments":true,"path":"2019/05/26/Some-useful-techniques-of-Matlab/","link":"","permalink":"http://yoursite.com/2019/05/26/Some-useful-techniques-of-Matlab/","excerpt":"","text":"Find all the .m files in the current folder and its subfolder(s).123456789101112subdir=genpath('.'); %Find all the subfolders in the current folderfiledir=regexp(subdir,pathsep, 'split'); %Split the char list into several cells, which contain the paths of every subfolderfor i = 1:length(filedir)-1 data_fn=dir([filedir&#123;i&#125;,'\\*.m']); %Find the .m files in every subfolder for j = 1:length(data_fn) path = [filedir&#123;i&#125;,'\\',data_fn(j).name]; % Find the path of every .m file % Your processing code for every .m file should be here. endend Reference:2019世界机器人大赛—BCI脑控机器人大赛 暨 第三届中国脑机接口大赛，matlab范例代码","categories":[],"tags":[{"name":"Basic Skills/基本技能","slug":"Basic-Skills-基本技能","permalink":"http://yoursite.com/tags/Basic-Skills-基本技能/"}],"keywords":[]},{"title":"Principal Components Analyses/主成分分析","slug":"Principal-Component-Analysis","date":"2019-05-16T23:53:40.000Z","updated":"2019-05-16T18:12:40.295Z","comments":true,"path":"2019/05/17/Principal-Component-Analysis/","link":"","permalink":"http://yoursite.com/2019/05/17/Principal-Component-Analysis/","excerpt":"","text":"1. Purpose and Interpretations of Principal Components Analysis (PCA)The goal of PCA is to construct sets of weights (called principal components) based on the covariance of a set of correlated variables (electrodes) so that components explain all of the variance of the data such that the components (1) are uncorrelated with each other and (2) are created so that the first principal component explains as much variance as possible for one variable, the second principal component explains as much of the residual variance as possible for one variable while being orthogonal to the first component, and so on, for as many components as there are electrodes (variables).PCA can be used to create a set of spatial filters in which the weights for each electrode are defined by patterns of interelectrode temporal covariance. PCA therefore highlights specific features of the data that might be difficult to identify in the spatially unfiltered data, because they are created by weighted combinations of all electrodes. PCA can also be interpreted as a data reduction technique by assuming that the components that account for a relatively large proportion of variance reflect true signal, whereas components that account for relatively little variance reflect noise.Another way to explain PCA is that it rotates axes in an N-dimensional space (where N is the number of variables or electrodes) such that the variance along each dimension is maximized, and the axes are orthogonal to each other. An example of principal components for two-dimensional (2-D) data is represented visually in the following figure. 2. Difference between PCA and other methodsDifference between the Surface Laplacian and PCAWhereas the surface Laplacian explicitly attenuates low-spatial frequency activity and therefore highlights local features of the data, PCA highlights global spatial features of the data by identifying patterns of large-scale covariance. Local topographical features contribute relatively little to the covariance matrix and are thus less likely to contribute to the first few principal components that are typically analyzed. Difference between Independent Component Analysis (ICA) and PCAPCA is used to decorrelate and reduce the dimensionality of a multivariate signal; ICA is used to demix independent sources that are embedded in multivariate signals. Thus, PCA decorrelates and ICA demixes.There are other important differences between PCA and ICA. PCA is computed using only second-order statistics (variances), whereas ICA also uses higher-order statistics such as skew and kurtosis. ICA uses iterative methods based on minimizing cost functions (typically via mutual information) to adjust weights, whereas PCA does not iterate to adjust weights except during some rotation methods. PCA components are constrained to be orthogonal to each other (except in some methods of rotation), whereas ICA does not assume that sources are orthogonal to each other.ICA is a standard and widely used technique in EEG data analyses. It is used to clean data prior to analyses (as discussed in section 8.1), and it is also used directly in analyses by analyzing component time courses instead of electrode time courses. 3. How PCA Is Computed The first step of computing a PCA is to construct a covariance matrix. in which X is an electrodes-by-time-points matrix, and is the mean signal of each electrode over time. Dividing by n can introduce a bias in the covariance at small n (e.g., less than 50). For larger n, the bias is likely to be negligible. EEG data covariance matrices are often computed from hundreds or thousands of observations, so whether n or (n – 1) is used is unlikely to have a significant negative impact on the PCA results.Once a covariance matrix is computed, the next step is to perform an eigendecomposition via the Matlab function eig, which returns eigenvalues and eigenvectors in ascending order. Thinking back to the above figure, the eigenvectors are the new rotated axes, and the eigenvalues are the lengths of those axes. In the parlance of PCA the eigenvectors are the principal components. Each column in the eigenvector matrix is a principal component, and each row stores the weights of each electrode. The eigenvalues can be scaled to percentage variance accounted for by dividing each eigenvalue by the sum of all eigenvalues and multiplying by 100. Converting eigenvalues to percentage variance accounted for provides an easily interpretable metric and has the added benefit that it puts all eigenvalues in the same scale and thus comparable across conditions, time windows, subjects, and so on regardless of the scale of the original data.The electrode weights for each component can be plotted as topographical maps, and time courses of the components can be obtained by multiplying the weights by the electrode time series data. Note that this means that each component has one associated time course (in other words, one electrode), and that time course is a weighted sum of the activity of all electrodes. 4. Distinguishing Significant from Nonsignificant ComponentsWhen considering a plot of the percentage variance accounted for over components, you will notice that only the first several components account for “ a lot ” of variance, and most of the later components account for relatively little variance. Often in the PCA the first several components will be considered signal, whereas the later components will be considered noise. Keep in mind that PCs are defined based on strengths of interelectrode covariance. Thus, weak interelectrode covariance would result in components with small eigenvalues even if they contain meaningful signal. In other words, spatially local features of the data can be meaningful and can be obscured by spatially broad features. So, labeling components as “ signal ” or “ noise ” based only on their eigenvalues should be done cautiously.Distinguishing significant from nonsignificant components involves determining a percentage variance threshold and considering components that explain variance above that threshold to be significant.There are several ways to determine the threshold. One way is to compute the percentage explained variance that would be expected from each component if all electrodes were uncorrelated with each other. In this case, each component would explain [100 × 1/ M] percent of the variance, where M is the number of electrodes/components. Another way to determine a threshold is to use permutation testing, whereby the data are randomly shuffled, a PCA is computed on the shuffled data, and the amount of variance explained in shuffled data, averaged over many repetitions, is taken as the threshold. The advantage of permutation-based thresholding over the analytic method described in the previous paragraph is that the data distributions and characteristics are retained. The two methods are showed as follows.Other methods for determining whether a component is significant include examining changes in the slope of the eigenvalue function or visually inspecting the plot of variance accounted for by each PC. 5. Rotating PCA Solutions Rotation involves selecting a number of significant components and applying iterative algorithms to further minimize variance along the selected dimensions. There are several methods for rotating principal components that make different assumptions about whether and how components can be correlated. Note that a rotated PCA solution will change if you rotate a different number of components, whereas the unrotated solution will always be the same.To rotate PCA solutions, you can try the PCA toolbox for Matlab (Dien 2010), which is designed specifically for handling EEG data. 6. Time-Resolved PCA It may seem inappropriate to include all time points into the covariance matrix, particularly the buffer zones (for edge artifacts) or intertrial intervals. Furthermore, different time periods within the trial might be associated with different neuro electrical modes or covariance configurations. Thus, PCA can be performed over successive time windows.If you perform a time-resolved PCA, you will need to decide how much time to include when computing the covariance matrix. There is a trade-off between temporal specificity (shorter periods of time help isolate temporal dynamics, particularly temporally brief dynamics) and signal-to-noise ratio (longer periods of time produce more stable estimates of covariance). In most cases, a time window of around 400 ms should be enough. 7. PCA with Time-Frequency InformationPCA can be combined with temporal bandpass filtering to highlight frequency-band-specific spatial features. This can be done by first bandpass filtering the time-domain signal (either via FIR filtering or via the real part of the result of wavelet convolution) and then following the same procedures as already outlined above. 8. PCA across Conditions PCA can be used for testing condition differences in part because PCA can be used as a data reduction technique. Rather than comparing the electrode-level activity across conditions, you can compare the PC-defined activity across conditions. Link:Brief Introduction to PCA in Chinese, Tengjun Liu. Reference:Cohen, Mike X. Analyzing neural time series data: theory and practice. MIT press, 2014.","categories":[],"tags":[{"name":"Analysis Method/分析方法","slug":"Analysis-Method-分析方法","permalink":"http://yoursite.com/tags/Analysis-Method-分析方法/"}],"keywords":[]},{"title":"How to plot figures in Matlab/Matlab中怎么作图","slug":"How-to-plot-figures","date":"2019-04-27T11:55:03.000Z","updated":"2019-04-27T06:18:31.194Z","comments":true,"path":"2019/04/27/How-to-plot-figures/","link":"","permalink":"http://yoursite.com/2019/04/27/How-to-plot-figures/","excerpt":"","text":"In this blog, I list some skills for figure ploting in Matlab, in case that I need to plot similar figures someday and I forget the commands. A bar figure with rotated text x label12345y = rand(1,5);figure,bar(y);x_test = &#123;'Text 1','Text 2','Text 3','Text 4','Text 5'&#125;;set(gca,'XTickLabel',x_test,'XTickLabelRotation',46); % the Key command 2.","categories":[],"tags":[{"name":"Basic Skills/基本技能","slug":"Basic-Skills-基本技能","permalink":"http://yoursite.com/tags/Basic-Skills-基本技能/"}],"keywords":[]},{"title":"Journals and Conferences about BCI/BCI领域的顶刊顶会","slug":"Top-Journals-and-Top-Conferences-about-BCI","date":"2019-04-13T08:46:42.000Z","updated":"2019-08-17T09:09:00.324Z","comments":true,"path":"2019/04/13/Top-Journals-and-Top-Conferences-about-BCI/","link":"","permalink":"http://yoursite.com/2019/04/13/Top-Journals-and-Top-Conferences-about-BCI/","excerpt":"","text":"Journals: EXPERT SYSTEMS WITH APPLICATIONS（SCIE) (1-2区)LetPub:English Version, 中文版 Annals of biomedical engineering (SCI) (2-3区)LetPub:English Version, 中文版 IEEE TRANSACTIONS ON NEURAL SYSTEMS AND REHABILITATION ENGINEERING (SCI) (1-2区)LetPub:English Version, 中文版 PLoS One (SCI) (3区)LetPub:English Version, 中文版 IEEE Transactions on Neural Networks and Learning Systems (SCI) (1区)LetPub:English Version, 中文版 IEEE TRANSACTIONS ON BIOMEDICAL ENGINEERING (SCI) (2区)LetPub:English Version, 中文版 Frontiers in Neuroscience (SCI) (2-3区)LetPub:English Version, 中文版 International Journal of Bifurcation and Chaos (SCI) (2-4区)LetPub:English Version, 中文版 Journal of NeuroEngineering and Rehabilitation（SCI)（2-3区）LetPub:English Version, 中文版 Conferences: The International IEEE EMBS Conference on Neural Engineering (NER) (EI complex) International BCI Meeting Graz Brain-Computer Interface Conference International Engineering in Medicine and Biology Conference IEEE SMC 9th Workshop on Brain-Machine Interface (BMI) Systems International Conference on Digital Signal Processing IEEE RAS/EMBS International Conference on Biomedical Robotics and Biomechatronics (BioRob) International Conference on Cyberworlds* Related links: IEEE brain","categories":[],"tags":[{"name":"Information about BCI/ BCI相关信息","slug":"Information-about-BCI-BCI相关信息","permalink":"http://yoursite.com/tags/Information-about-BCI-BCI相关信息/"}],"keywords":[]},{"title":"Intertrial Phase Clustering (To be updated)/跨trial相位聚集 (待更新)","slug":"Intertrial-Phase-Clustering","date":"2019-04-12T15:14:50.000Z","updated":"2019-04-29T21:13:42.193Z","comments":true,"path":"2019/04/12/Intertrial-Phase-Clustering/","link":"","permalink":"http://yoursite.com/2019/04/12/Intertrial-Phase-Clustering/","excerpt":"","text":"After time-frequency analysis, we will get a complex number at a specific time-frequency point, which represents the useful information of magnitude and angle. Here, we discuss the analysis of intertrial EEG signals from the angular perspective. The Average of AnglesFirstly, of course the angles cannot be averaged like the values or powers, since they are circular, for example, pi equals to 3*pi, their averaged angle should be the same as them, but if you just take their average like the real numbers, you will get 2*pi, which is obviously wrong.So, how should we calculate the averaged angle? Let’s consider the complex vector. 2.","categories":[],"tags":[{"name":"Analysis Method/分析方法","slug":"Analysis-Method-分析方法","permalink":"http://yoursite.com/tags/Analysis-Method-分析方法/"}],"keywords":[]},{"title":"Common Spatial Pattern(CSP) and Its Improvements/共空间模式及其改进方法","slug":"Common-Spatial-Pattern","date":"2019-03-24T10:04:27.000Z","updated":"2019-05-16T18:01:16.564Z","comments":true,"path":"2019/03/24/Common-Spatial-Pattern/","link":"","permalink":"http://yoursite.com/2019/03/24/Common-Spatial-Pattern/","excerpt":"","text":"Introduction of Common Spatial Pattern1. Why spatial filtering is important? Raw EEG scalp potentials are known to have a poor spatial resolution owing to volume conduction. And data-driven approaches to calculate subject-specific spatial filters have proven to be useful for this situation, as shown in the following figure[1]. From the figure above, we can see that CSP is very useful for the discrimination of motor imagery. 2. How does CSP work?CSP is a technique to analyze multichannel data based on recordings from two classes (conditions). CSP yields a data-driven supervised decomposition of the signal parameterized by a matrix that projects the signal in the original sensor space to the surrogate space. In a nutshell, CSP filters maximize the variance of the spatially filtered signal under one condition while minimizing it for the other condition. The effect of CSP is shown below. Math Behind CSPFirst, we calculate the covariance matrix. Define the EEG signals as , every row represents a trial. Considering the feature of EEG signals, we get: So, In a perspective of matrix, the above formula can be rewrriten as: , + means left-hand imagery, while - means right-hand imagery. In the following section, we whiten the covariance matrix. First, define G: . Because the covariance matrices are symmetrical, G is symmetrical, too. Second, do the eigen decomposition of G: .Because G is symmetrical, .So, . Third, define P: . So, we get:. Becasue is a diagonal matrix, we get: So after all the effect, we get a very important formula:.This formula exactly explain why CSP filters maximize the variance of the spatially filtered signal under one condition while minimizing it for the other condition. Finally, whiten the matrices: In the end, we solve the general eigen decomposition of and : Because the covariance matrices are symmetrical, the whitened covariance matrices are symmetrical, too. So, the matrices of their eigen vectors are orthogonal, i.e., . So:Because , we get: So: After the processing, we can transform the signals to the new space: Some Key Code of CSP1234567891011121314Fea_NUM = 3; % The number of the chosen features of CSPC = conv(X); % Calculate covariance matrixfor i = 1:3 C_mean&#123;i&#125; = mean(C(find(label==i))); % Calculate average covariance matrixend% G = C_mean&#123;1&#125;+C_mean&#123;2&#125;; % Whiten, all these steps can be ignored.% [Ug,Lambdag] = eig(G);% P = sqrt(lambdag^(-1))*Ug';%for i = 1:3% C_mean_w&#123;i&#125; = P*C_mean&#123;i&#125;*P'; % Calculate whitened covariance matrix%end[V1,~]=eig(C_mean&#123;1&#125;,C_mean&#123;2&#125;); % Calculate the general eigendecomposition problemfea_idx=[1:Fea_NUM,size(V1,2)+(-Fea_NUM+1:0)];fea(s_idx,:)=log(diag(V1(:,fea_idx)'*C&#123;s_idx&#125;*V1(:,fea_idx))); % Feature extraction Improvements of CSP Multiclass: In its original form, CSP is restricted to binary problems. A general way to extend this algorithm to the multiclass case is to apply CSP to a set of binary subproblems (all binary pairs or, preferably, in a one-versus-rest scheme).A more direct approach by approximate simultaneous diagonalization was proposed in [2]. 12345[V1,~]=eig(C_mean&#123;1&#125;,C_mean&#123;2&#125;);[V2,~]=eig(C_mean&#123;1&#125;,C_mean&#123;3&#125;);[V3,~]=eig(C_mean&#123;2&#125;,C_mean&#123;3&#125;);fea_idx=[1:Fea_NUM,size(V1,2)+(-Fea_NUM+1:0)];V=[V1(:,fea_idx),V2(:,fea_idx),V3(:,fea_idx)]; The common spatio-spectral pattern (CSSP): It solves the standard CSP problem on the EEG time series augmented by delayed copies of the original signal, thereby obtaining simultaneously optimized spatial filters in conjunction with simple frequency filters. More specifically, CSP is applied to the original x concatenated with its off τ ms delayed version x(t− τ). This amounts to an optimization in an extended spatial domain, where the delayed signals are treated as new channels. This technique automatically neglects or emphasizes specific frequency bands at each electrode position in a way that is optimal for the discrimination of two given classes of signals. The common sparse spectral spatial pattern (CSSSP):It eludes the problem of manually selecting the frequency band in a different way. Here a temporal FIR filter is optimized simultaneously with a spatial filter. In contrast to CSSP only one temporal filter isused, but this filter can be of higher complexity. In order to control the complexity of the temporal filter, a regularization scheme is introduced which favors sparse solutions for the FIR coefficients. Although some values of the regularization parameter seem to give good results in most cases, for optimal performance a model selection has to be performed. An iterative method (SPEC-CSP): It alternates between spatial filter optimization in the CSP sense and the optimization of a spectral weighting. As result, one obtains a spatial decomposition and a temporal filter with are jointly optimized for the given classification problem. Connection to a discriminative model: This connection is of theoretical interest in itself, and can also be used to further elaborate new variants of CSP. Regularizing CSP: In [3], a regularization on the CSP filter coefficients was proposed to enforce a sparse solution; that is, many filter coefficients become numerically zero at the optimum. Therefore, it provides a clean way of selecting the number and the positions of electrodes. Their results have shown that the number of electrodes can be reduced to 10–20 without significant drop in the performance. Some advanced techniques towards reducing calibration data: More details in [1]. Reference:[1] Blankertz, Benjamin, et al. “Optimizing spatial filters for robust EEG single-trial analysis.” IEEE Signal processing magazine 25.1 (2008): 41-56.[2] G. Dornhege, B. Blankertz, G. Curio, and K.-R. Müller, “Boosting bit rates in non-invasive EEG single-trial classifications by feature combination and multi-class paradigms,” IEEE Trans. Biomed. Eng., vol. 51, no. 6, pp. 993–1002, June 2004.[3] J. Farquhar, N.J. Hill, T.N. Lal, and B. Schölkopf, “Regularised CSP for sensor selection in BCI,” in Proc. 3rd Int. Brain-Computer Interface Workshop Training Course 2006, Verlag der Technischen Universität Graz, Graz, Austria, pp. 14–15.","categories":[],"tags":[{"name":"Feature Extraction/特征提取","slug":"Feature-Extraction-特征提取","permalink":"http://yoursite.com/tags/Feature-Extraction-特征提取/"}],"keywords":[]},{"title":"Basic Statistics (To be updated)/基本统计学 (待更新)","slug":"Basic-Statisticss","date":"2019-03-15T16:29:41.000Z","updated":"2019-03-24T09:21:46.147Z","comments":true,"path":"2019/03/15/Basic-Statisticss/","link":"","permalink":"http://yoursite.com/2019/03/15/Basic-Statisticss/","excerpt":"","text":"(Student’s) t-test","categories":[],"tags":[{"name":"Basic Knowledge/基本知识","slug":"Basic-Knowledge-基本知识","permalink":"http://yoursite.com/tags/Basic-Knowledge-基本知识/"}],"keywords":[]},{"title":"How to Read and Write a Paper/怎么读/写论文","slug":"How-to-Read-and-Write-a-Paper-怎么读-写论文","date":"2019-03-12T09:12:08.000Z","updated":"2019-04-29T21:28:31.139Z","comments":true,"path":"2019/03/12/How-to-Read-and-Write-a-Paper-怎么读-写论文/","link":"","permalink":"http://yoursite.com/2019/03/12/How-to-Read-and-Write-a-Paper-怎么读-写论文/","excerpt":"","text":"How to choose and read a paperFirst of all, we need to choose the papers that are worth reading. Here lists some guidance: Classic reviews: This kind of articles are rather useful for getting started in a brand-new field. We can learn a lot of basic method and opinions in this field. Classic pit-digging articles: Here, the pits mean somewhere plenty of researchers will go. In other words, this kind of articles lead new directions in this field. Classic method articles: This kind of articles can be cited in the reviews, but sometimes the content in the reviews is too concise to understand deeply. So, we need to go back to the original articles, which are often with more details. Here, methods include problem formulation, theory, algorithm, experimental design, etc. Classic textbooks: Some totally basic knowledge is regarded as the common knowledge that everyone knows. So, if we need to learn something basic, we’d better go back to the classic textbooks. Others: Some prerequisites, complements, comparisons of this field or the major methods of this field. After we decide our research question, though all the papers can provide us with some useful information, we need to read those that are most related to our research question. In other words, we need to judge if a paper is worthy for our research. Relativity: We can judge from the title, key words, abstract, conclusion, charts, etc. We need to do this fast. Quality: We can judge from the author or the lab, or the citation the paper gets. After we choose the papers we want to read, we need to know how to read it effectively. In a paper, it’s four factors that matters, including What, Why, How, and the second What. What: What’s the author’s research question? Why: Why would the author do the research? What’s importance? What’s the implication? What’s the relevance of this research with the others? How: How did the author try to solve the problem? What’s the problem formulation? What’s the research method? How did the author get the data? What’s experiments? etc. What: What’s the conclusion of this research? What’s the perspective and outlook of this research? Sometimes, a good paper just presents a good story. How to write a paper Idea searching. For a long time: Record every inspiration we get from the daily life or some documents. And we should remember: more reading, thinking and discussing, more improvement our ideas will get. Finally, sometimes when gathering the dots, we may get some brand-new ideas and do a rather great job. For a short time: Try to improve the existing methods. Apply the methods you know to some new field. etc. But make sure that your idea has not been published. Document research.Go back to the text above to see which papers are worth reading and how to choose and analyze a paper. Preliminary validation.Proof of concept. Exploring in depth.Do the experiments and collect the data. After that analyze them. The factors of paper writing. Title: Concisely summarize the content in the paper, and draw the attention of the readers. Some typical styles are listed as follows: Question. Question + Solution. Story Telling. Avoid abbreviations, jargon, brand, and unusual or outdated terminology in the title. Principle: ABC, i.e., accuracy, brevity and clarity. Author and address: Place the authors in order and the address should be the authors’ departments/colleges. Key Words: They should be precise, attractive, convenient for indexing. Field, question, method, new terminologies can be included. The number of key words should be around 5. Abstract: Principle: PARI, no reference, no special symbols, third person and passive voice. Problem/Background. Approach. Result. Impact.The abstract should be a story with good logic. Introduction: The structure of this part should be like a filter, from a large scale to a small one. Introduce the background, importance of the paper and the method, conclusion of the paper.Specifically: Background: it presents the readers the researching knowledge. Question and its importance. Simple introduction of the research method and the conclusion. The importance of the conclusion. (Optional) The perspective. Literature review: relation to the existing literature, rationale for case/data/method selection. Problem formulation: Set up the model. Make the practical problems abstract and the abstract problems concrete. Method: Introduce the research method with details, including the reasonability of the method (algorithm), the collection of the data, the experiments, etc. And pay attention to past tense. If human subjects were used, the criteria for selection should be described, and an ‘informed consent’ statement should be included in the manuscript. Result: It is an integrated process of argumentation. (Hypothesis, arguments, logic, analysis, etc.) The result contains wo factors: overall description of the experiment and the representative data (but not endlessly repetitive data). Don’t repeat the words of what is already apparent to the reader from examining the figures and tables. And it should be presented in the past tense. Discussions: The meaning of the result. Discussion the problem under a bigger background, like the complements to the theory and the methodology, the contribution to the industry. Summary/Conclusion/Perspectives: Summarize the paper and give the outlook. Reference/Bibliography: Different styles for different journals. Google scholar and EndNote can generate the citation automatically. Appendix/Supplemental Materials/Notation Table (Optional) Summary, reflection and prospect. Some thinking about scientific writing: A scientific experiment is not complete until the result has been published and understood. The words of scientific writing should be as clear, simple, and well-ordered as possible. appropriate language is a key to communicating clearly and efficiently in science. The words should be used in certain meaning. And The best English in scientific writing is that which gives the sense in the fewest short words. In addition to these two factors, the third principal ingredient of a scientific paper should be Effective organization. It means organizing ideas with the standard format for a scientific paper, like the IMRAD (introduction, method, result, and discussion). The principle of reproducibility of experiments is a fundamental tenet of the philosophy of science. Good writing is largely a matter of effective imitation. Obtaining copies of highly regarded scientific papers in our research area, including the papers in the journal to which we want to submit our work is very important. Ask ourselves: What sections do they include? And in what order? How long do the various sections tend to be? What types of subheadings, if any, tend to be included? How many figures and tables, and what types thereof, are typical? What are the standard phrases that we can use in presenting our work? We should read and follow the instructions issued by the journals. Preparing to speak can help in formulating the articles. Also, questions from the listeners can help us shape what we will write. Research typically is a team endeavor. So is reporting on research. Some useful software, like Dropbox, Google Docs, can be used. We should do some pre-writing work. For example, stack copies of published papers in the order in which we plan to cite them. Make outlines. List points we wish to make in a given section. First do the addition, and then do the subtraction. First decide what kinds of figures we may use in the paper and their order, and then we can write our paper following the figure series. In revising our work, ask ourselves the following questions: Dose the manuscript include all the information it should? Should any content be deleted? Is all the information accurate? Is the content consistent throughout? Is everything logically organized? Is everything clearly worded? Have we stated our points briefly, simply and directly? Is everything concise? Are grammar, spelling, punctuation, and word use correct throughout? Are all figures and tables well designed? Dose the manuscript comply with the instructions? The manuscript can be shown to some expert, someone in our general field, and some intelligent general reader. Ethics in scientific publishing: authenticity and accuracy, originality, credit, ethical treatment of humans and animals, disclosure of conflicts of interest. How to design effective tables: typical useless tables: Whenever a table, or columns with a table, can be readily put in words, do it. If a condition is not a variable, don’t put it in a table. There should not be too many 0s or 100s in a table. Do not contain a word list as a table in a scientific paper. Never present the data in more than one way. Of course, selected data can be singled out for discussion in the text. How to arrange tabular materials:The data should be organized so that the like elements read down, not across. Virtually all tables are constructed by horizontal rules(lines) but not vertical ones. The following is an example. Follow the journal’s instructions. If abbreviations must be defined, we often give all or most of them in the first table. Then later tables can carry the simple footnote: “Abbreviations as in Table 1”. Use words that will be clear without reference to the text. For example, do not use ‘Group 1’ and ‘Group 2’ and so on. If a paper includes a series of tables presenting analogous data, use an analogous format for each. How to prepare effective graphs: The size of the lettering must be based on the anticipated reduction that will occur in the publishing process. If the paper contains two or more graph that are most meaningful when viewed together, consider grouping them in a single illustration. Design graphs, like tables, to be understandable without the text. Use and misuse of English: Learn to appreciate the sheer beauty of the simple declarative sentence. No double negatives, no hyperbole, no clichés, no metaphors, etc. Watch for wrongly used or redundant words. Some examples are as follows: amount: Use this word when referring to a mass or aggregate, e.g., an amount of cash. “An amount of coins” is wrong. like: Should be used just as a preposition, but not a conjunction. When a conjunction is needed, substitute “as”. quite: this word is quite unnecessary. varying: ‘varying’ is not ‘various’. Most of the abstract, materials, methods and results sections should be in the past tense. On the other hand, most of the introduction and much of the discussion should be in the present tense. Passive voice sometimes functions well in the methods section. Elsewhere in a scientific paper, however, it rarely should be chosen. Avoid euphemistic words. Avoid jargon/verbosity. Don’t use the so-called high-level words too often, or you are writing in jargon. The guidance to check a scientific writing: Is the content complete, or should any content be added? Should any content be deleted? Is all the content accurate? Is all the logic sound? Do the content and crafting of the piece suit the audience? Dose the piece follow appropriate conventions regarding overall format? If subheadings are allowed, are they used effectively? Are sections and paragraphs of appropriate length? Should any tables or figures be added or deleted? If tables or figures are included, are they well designed? Would typographic devices, such as italics of bullets, be helpful anywhere? Are grammar, spelling, punctuation, and usage correct throughout? Is the piece well organized at various levels? Are verbs tenses appropriate? Are antecedents of all pronouns clear? Have all acronyms been defined? Are they worth using? Are sentences of appropriate length and structure? If references are cited, are they in the appropriate format? Do all cited references appear in the reference list, and are all listed references cited in the text? Is the writing clear, exact, and concise? Have all instructions been followed? Reference:Gastel, Barbara, and Robert A. Day. How to write and publish a scientific paper. ABC-CLIO, 2016.","categories":[],"tags":[{"name":"Basic Skills/基本技能","slug":"Basic-Skills-基本技能","permalink":"http://yoursite.com/tags/Basic-Skills-基本技能/"}],"keywords":[]},{"title":"Some Useful Techniques in Word For Paper Writing (Updating)/一些便于论文写作的Word技巧(随时更新)","slug":"Some-Useful-Techniques-in-Word-For-Paper-Writing","date":"2019-03-11T22:36:26.000Z","updated":"2019-03-24T09:21:44.795Z","comments":true,"path":"2019/03/11/Some-Useful-Techniques-in-Word-For-Paper-Writing/","link":"","permalink":"http://yoursite.com/2019/03/11/Some-Useful-Techniques-in-Word-For-Paper-Writing/","excerpt":"","text":"Tables can be a very useful tool. To set several columns with different width. To Create some special Figure (Figure with some text around). To set the formulas in the middle of the page. Multilevel lists can be used to save some our energies, and make the paper’s structure easier to maintain. Cross-references are very important in citations! When the cross-references are well set, you do not need to change every index every time you change a reference’s information. Everything will be done automatically. The cross-references include chapters, figures, formulas, Two Word files after being revised can be combined together in 审阅-&gt;比较","categories":[],"tags":[{"name":"Basic Skills/基本技能","slug":"Basic-Skills-基本技能","permalink":"http://yoursite.com/tags/Basic-Skills-基本技能/"}],"keywords":[]},{"title":"Basic grammar of Markdown/Markdown的基本语法","slug":"Basic-grammar-of-Markdown","date":"2019-03-10T23:46:48.000Z","updated":"2019-08-13T10:06:26.808Z","comments":true,"path":"2019/03/11/Basic-grammar-of-Markdown/","link":"","permalink":"http://yoursite.com/2019/03/11/Basic-grammar-of-Markdown/","excerpt":"","text":"1. Header: The symbol “#” indicates the level of a header, which is shown as follows: first-level header “# first-level header”: first-level header second-level header “## second-level header”: second-level header fifth-level Header “##### fifth-level header”: fifth-level header And so on. 2. Typeface: Bold: **The text to be bold** Result: The text to be bold Italic: *The test to be italic* Result: The text to be italic Bold and Italic: ***The test to be bold and italic*** Result: The test to be bold and italic Strikethrough: ~~The test to be strikethrough~~ Result: The test to be trikethough Newline: two ‘ ‘ in the gap between the 2 texts. Or &lt; br&gt; (No ‘ ‘). Result:Tip: If you want share your library by copying the files, you need to copy both the .data file and the .enl file. They need to work together. Be placed in the middle: &lt; center&gt;markdown&lt; /center&gt; (No ‘ ‘). markdown 3. Quotation: The symbol “&gt;” indicates the level of a quotation just as what “#” does. Grammar: &gt; the quotation &gt;This is the first-level quotation And so on. 4. Split Line: Symbol: more than 3 “-“ or “*“, the results are shown as follows: 5.Figure: Grammar: ![the caption(shown below the figure)](the address of the figure (can be online or offline)”the title of the figure (shown when the mouse is over the figure)”) However, the offline way is not recommended. (Offline way cannot be use in deployment of a website) Place the figure in the middle: &lt; div align=center&gt; (No the first ‘ ‘). ![ ]( ) &lt; div align=left&gt; (No the first ‘ ‘) Result: set the figure’s size: &lt; img width=200 src=”the link of the figure.png” &gt; Result: 6. Hyperlink: Grammar: [Hyperlink’s name](Address “title”) Emoji’s website 7. List: Unordered: symbol ‘-’ or ‘+’ or ‘*‘, the result is just like this line. Ordered: 1. or 2. or 3. and so on, the result is just like this line. nesting: three ‘ ‘(blank) between the indexes. 8. Table:Grammar:(No blank line!) header 1|header 2|deader 3 —|:–:|—: content 11|content 21|content 31 content 12|content 22|content 32 The result is as follows: header 1 header 2 deader 3 content 11 content 21 content 31 content 12 content 22 content 32 9. Code:Grammar: ‘One-line code’ create database hero; ‘’’ A passage of code’’’ 1234function fun()&#123; echo &quot;Hello world!&quot;;&#125;fun(); 10. Formula: Use the website: LateXFormula Create the formula and then Choose ‘URL Encoded’ option below. Copy the URL and then paste it in Markdown. Example:","categories":[],"tags":[{"name":"Basic Skills/基本技能","slug":"Basic-Skills-基本技能","permalink":"http://yoursite.com/tags/Basic-Skills-基本技能/"}],"keywords":[]},{"title":"Basic usage of EndNote/EndNote的基本使用","slug":"Basic-usage-of-EndNote","date":"2019-03-10T23:45:58.000Z","updated":"2019-03-12T13:31:11.462Z","comments":true,"path":"2019/03/11/Basic-usage-of-EndNote/","link":"","permalink":"http://yoursite.com/2019/03/11/Basic-usage-of-EndNote/","excerpt":"","text":"IntroductionEndNote is a software developed by ISI Thomson. Its main features include: Collect and store the documents. (Title, author, year, journal, reference type, etc.) Find and manage the documents. (Search, rating, group, etc.) Help the researchers use the correct format for the papers. (Paper templates for different journals, working together with Word, etc.) We can regard what EndNote does as building a personal library, where the books, journals, videos, legal papers, pictures and others are stored. Besides EndNote Desktop, EndNote Web is also available. Building or opening a libraryFile-&gt; New… or File-&gt; Open Library… or Open recent Tip: If you want share or move your library by copying the files, you need to copy both the .data file and the .enl file. They need to work together. Importing Documents Manual input(Not recommended):Reference -&gt; New Reference or click the ‘New Reference’ button or use the keyboard shortcut (Ctrl+N). When you input the author, the system will regard the last word as the family name automatically. And if the author’s given name contains more than one word, the first name and the last name should be separated by ‘,’. Remember to attach the files (.pdf, .jpg, .mov, etc.), if not, it’s just a bunch of information. Use ‘the find full text’ function can make it easy to get done. Steps:Choose the document you want to find the full text, and then click the Reference-&gt; Find full text. Make sure you have right network connect, which means you can get access to the databases. Importing file…/Folder…:File-&gt;Import-&gt;File…/Folder…. When you are importing a file, remember to change the import option to DPF. Besides, you can import a library here just by change the import option to EndNote Library. When you are importing a folder, you can choose if the result includes the subfolders and create a group set for this import. Importing online:Take Web of Science as an example. Choose the papers need downloading. Choose save to EndNote Desktop (Or EndNote Online if you like). Choose the content to be saved and click send button. Open the .ciw file that is just downloaded by EndNote Desktop. Find full text for the papers or attach them manually. Likely, this approach can be used in Google Scholar, 万方数据库, etc. More details about how to import documents from different databases or connect other libraries can be seen in EndNote &amp; Word文献管理与论文写作 第2版_童国伦主编2014.pdf. Managing the Libraries Group: Set up groups: To classify the documents. Right-click the ‘My Groups’ in the left of the UI. Groups-&gt;Create Group Smart Group:Assemble the documents that contain the same key words. Create groups from groups.Create From Groups: Intersection, complement, etc. Create groups set.The directory above the groups level. Search the documents. Quick search. Search Panel. Click the button to use. Find the Duplicates. References-&gt;Find Duplicates The setting of this function can be changed in Edit-&gt;Preference-&gt;Duplicates Revise the documents’ data (Title, abstract, etc.)Edit-&gt;Find and Replace Back-up for the libraries. Copy and paste the .data and .enl files. File-&gt;Save a Copy… Compress the LibraryCompressed Library(.enlx)… Filter.Filters need to be created or found online when the embedded filters are not enough, more details is in EndNote &amp; Word文献管理与论文写作 第2版_童国伦主编2014.pdf. Change the field(字段) to be shown about a document.Edit-&gt;Preference-&gt;Display Fields Paper Writing Papers templates.Tools-&gt;Manuscript templates. Cite While You Write (CWYW).To use this function, you need to open both EndNote and Word. Direct Way: Drag the papers you want to cite in EndNote to Word. Click the ‘Update Citations and Bibliography’ in EndNote X9 (or other versions) in Word. Searching Way: Click the ‘Insert Citations’ in the Toolbar in EndNote X9 in Word. Input the key words in the blank, and then find the references. Choose the one/ones you want to refer.The Style can be changed by the style options in the toolbar. Insert Figure. First, import the figures into EndNote. Click the ‘Insert Citations’ in the Toolbar in EndNote X9 in Word, choose to insert figure… Place the references in different chapters. Use the section breaks. More details are shown in EndNote &amp; Word文献管理与论文写作 第2版_童国伦主编2014.pdf. Change/Delete the references. Word-&gt;EndNote X9-&gt;Edit &amp; Manage Citation(s) Finish Writing. Export the references in the paper: Export to EndNote-&gt;Export Travelling Library Convert to Plain Text: Convert Citations and Bibliography-&gt;Convert to Plain Text EndNote Web All the operations are similar to the ones in the Desktop version. More details are shown in EndNote &amp; Word文献管理与论文写作 第2版_童国伦主编2014.pdf.","categories":[],"tags":[{"name":"Basic Skills/基本技能","slug":"Basic-Skills-基本技能","permalink":"http://yoursite.com/tags/Basic-Skills-基本技能/"}],"keywords":[]}]}